In [27]:
from word2number import w2n

In [28]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [29]:
data=pd.read_csv("G:/Datasets/hiring.csv")
data

  expericence  test_score(out of 10)  interview_score(out of 10)  salary($)
0         NaN                    8.0                           9      50000
1         NaN                    8.0                           6      45000
2        five                    6.0                           7      60000
3         two                   10.0                          10      65000
4       seven                    9.0                           6      70000
5       three                    7.0                          10      62000
6         ten                    NaN                           7      72000
7      eleven                    7.0                           8      80000

In [30]:
data['expericence']=data['expericence'].fillna('zero')

In [31]:
data['expericence']

0      zero
1      zero
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: expericence, dtype: object

In [40]:
import math
median_test_score=math.floor(data['test_score(out of 10)'].mean())
data['test_score(out of 10)']=data['test_score(out of 10)'].fillna(median_test_score)

In [33]:
data['expericence']=data['expericence'].apply(w2n.word_to_num)
data.head()

   expericence  test_score(out of 10)  interview_score(out of 10)  salary($)
0            0                    8.0                           9      50000
1            0                    8.0                           6      45000
2            5                    6.0                           7      60000
3            2                   10.0                          10      65000
4            7                    9.0                           6      70000

In [43]:
reg=linear_model.LinearRegression()
reg.fit(data[['expericence','test_score(out of 10)','interview_score(out of 10)']],data['salary($)'])

LinearRegression()

In [44]:
# 2yr experience, 9 test score , 6 interview score, salary?
reg.predict([[2,9,6]])

array([53713.86677124])

In [45]:
# 12yr experience, 10 test score , 10 interview score, salary?
reg.predict([[12,10,10]])

array([93747.79628651])